#ifndef ANGBANDGAME_H
#define ANGBANDGAME_H

#include <QMainWindow>
#include <QPainter>
#include <QKeyEvent>
#include <QDebug>
#include <QMessageBox>
#include "startmenu.h"

QT_BEGIN_NAMESPACE
enum Action{
    ROOM1, BRIDGE, ROOM2, GAME, //Р СџР ВµРЎР‚Р ВµРЎвЂЎР С‘РЎРѓР В»Р ВµР Р…Р С‘Р Вµ Р Т‘Р В»РЎРЏ Р С•РЎвЂљРЎР‚Р С‘РЎРѓР С•Р Р†Р С”Р С‘ Р С”Р В°РЎР‚РЎвЂљРЎвЂ№
    LEFT, RIGHT, UP, DOWN, STAND, //Р Т‘Р В»РЎРЏ Р Т‘Р Р†Р С‘Р В¶Р ВµР Р…Р С‘Р Вµ Р С”Р В»Р В°Р Р†Р С‘РЎвЂЎ
    HUMAN, DWARF, SOLDIER, WARRIOR, BEGIN, END //Р Т‘Р В»РЎРЏ РЎС“Р С—РЎР‚Р В°Р Р†Р В»Р ВµР Р…Р С‘Р Вµ Р СР С•Р Т‘Р ВµР В»РЎРЉР С”Р С•Р в„– Р С‘Р С–РЎР‚Р С•Р С”Р В°
};

namespace Ui { class AngBangGame; }
QT_END_NAMESPACE

class AngBangGame : public QMainWindow
{
    Q_OBJECT

public:
    AngBangGame(QWidget *parent = nullptr);
    ~AngBangGame();

public slots:
    void slotsStart(bool); //Р С—РЎР‚Р С‘Р Р…Р С‘Р СР В°Р ВµРЎвЂљ Р С•РЎвЂљР С”Р В»Р С‘Р С” Р С”Р Р…Р С•Р С—Р С•Р С” Р С•РЎвЂљ РЎРѓРЎвЂљР В°РЎР‚РЎвЂљР С•Р Р†Р С•Р С–Р С• Р С•Р С”Р Р…Р В°

protected:
    void paintEvent(QPaintEvent *event); //Р С•РЎвЂљРЎР‚Р С‘РЎРѓР С•Р Р†Р С”Р В°
    void keyPressEvent(QKeyEvent *event); //Р С”Р В»Р В°Р Р†Р С‘РЎв‚¬Р С‘
    void timerEvent(QTimerEvent *event); //РЎвЂљР В°Р в„–Р СР ВµРЎР‚ (РЎРѓРЎвЂЎРЎвЂРЎвЂљРЎвЂЎР С‘Р С”)

private:
    const int SIZE_WINDOW = 850; //РЎР‚Р В°Р В·Р СР ВµРЎР‚ Р С‘Р С–РЎР‚РЎвЂ№
    const int SIZE_STONE = 30; //РЎР‚Р В°Р В·Р СР ВµРЎР‚ Р С”Р В»Р ВµРЎвЂљР С•Р С” Р В·Р В°Р СР С”Р В°
    const int START_POZ = 100; //РЎРѓРЎвЂљР В°РЎР‚РЎвЂљР С•Р Р†Р В°РЎРЏ Р С—Р С•Р В·Р С‘РЎвЂ Р С‘РЎРЏ Р В·Р В°Р СР С”Р В°
    const int VALUE_ROOM1 = 13, VALUE_ROOM2 = 7; //Р С”Р С•Р В»Р С‘РЎвЂЎР ВµРЎРѓРЎвЂљР Р†Р С• Р С”Р В»Р ВµРЎвЂљР С•Р С” Р С—Р ВµРЎР‚Р Р†Р С•Р в„– Р С‘ Р Р†РЎвЂљР С•РЎР‚Р С•Р в„– Р С”Р С•Р СР Р…Р В°РЎвЂљРЎвЂ№
    const int VALUE_BRIDGE = 10; //РЎР‚Р В°Р В·Р СР ВµРЎР‚ Р С”Р В»Р ВµРЎвЂљР С•Р С” Р СР С•РЎРѓРЎвЂљР В° Р СР ВµР В¶Р Т‘РЎС“ Р С”Р С•Р СР Р…Р В°РЎвЂљР В°Р СР С‘
    const int SIZE_ORC = 30; //РЎР‚Р В°Р В·Р СР ВµРЎР‚ Р Р†РЎР‚Р В°Р С–Р В° (Р С•РЎР‚Р С”Р В°)
    const int SIZE_W_SOLDIER = 24, SIZE_H_SOLDIER = 27; //РЎР‚Р В°Р В·Р СР ВµРЎР‚ Р С—Р С• РЎв‚¬Р С‘РЎР‚Р С‘Р Р…Р Вµ Р С‘ Р Р†РЎвЂ№РЎРѓР С•РЎвЂљР Вµ Р Р†Р С•Р С‘Р Р…Р В°
    const int SIZE_W_HUMAN = 20, SIZE_H_HUMAN = 27; //РЎР‚Р В°Р В·Р СР ВµРЎР‚ Р С—Р С• РЎв‚¬Р С‘РЎР‚Р С‘Р Р…Р Вµ Р С‘ Р Р†РЎвЂ№РЎРѓР С•РЎвЂљР Вµ РЎвЂЎР ВµР В»Р С•Р Р†Р ВµР С”Р В°
    const int SIZE_W_DWARF = 15, SIZE_H_DWARF = 27; //РЎР‚Р В°Р В·Р СР ВµРЎР‚ Р С—Р С• РЎв‚¬Р С‘РЎР‚Р С‘Р Р…Р Вµ Р С‘ Р Р†РЎвЂ№РЎРѓР С•РЎвЂљР Вµ Р С–Р Р…Р С•Р СР В°
    const int SIZE_W_WARRIOR = 27, SIZE_H_WARRIOR = 24; //РЎР‚Р В°Р В·Р СР ВµРЎР‚ Р С—Р С• РЎв‚¬Р С‘РЎР‚Р С‘Р Р…Р Вµ Р С‘ Р Р†РЎвЂ№РЎРѓР С•РЎвЂљР Вµ Р С–Р Р…Р С•Р СР В° - Р Р†Р С•Р С‘Р Р…Р В°
    const int SPEED = 10; //РЎРѓР С”Р С•РЎР‚Р С•РЎРѓРЎвЂљРЎРЉ Р С—Р ВµРЎР‚Р ВµР Т‘Р Р†Р С‘Р В¶Р ВµР Р…Р С‘РЎРЏ Р СР С•Р Т‘Р ВµР В»Р ВµР С”
    const int DOOR = 20; //РЎР‚Р В°Р В·Р СР ВµРЎР‚ Р Р…Р В°РЎвЂЎР В°Р В»Р В° Р СР С•РЎРѓРЎвЂљР В°

    Ui::AngBangGame *ui;
    startMenu* start; //РЎРѓРЎвЂљР В°РЎР‚РЎвЂљР С•Р Р†Р С•Р Вµ Р С•Р С”Р Р…Р С•

    struct Stone{ //РЎРѓРЎвЂљРЎР‚РЎС“Р С”РЎвЂљРЎС“РЎР‚Р В° Р Т‘Р В»РЎРЏ Р С”Р В»Р ВµРЎвЂљР С•Р С”
        QImage s;
        int x;
        int y;
    };

    struct Person{ //РЎРѓРЎвЂљРЎР‚РЎС“Р С”РЎвЂљРЎС“РЎР‚Р В° Р Т‘Р В»РЎРЏ РЎвЂљР С‘Р С—Р В° Р С—Р ВµРЎР‚РЎРѓР С•Р Р…Р В°Р В¶Р ВµР в„–
        QImage s;
        int x;
        int y;
    };

    //Р С—Р С•Р В·Р С‘РЎвЂ Р С‘РЎРЏ Р Р…Р В°РЎвЂЎР В°Р В»Р В° Р СР С•РЎРѓРЎвЂљР В°
    int x_door;
    int y_door;

    //Р С—Р ВµРЎР‚Р ВµР СР ВµР Р…Р Р…РЎвЂ№Р Вµ:

    Action act = ROOM1; //Р Т‘Р В»РЎРЏ Р С•РЎвЂљРЎР‚Р С‘РЎРѓР С•Р Р†Р С”Р С‘ Р В·Р В°Р СР С”Р В°
    Action move = STAND; //Р Т‘Р В»РЎРЏ Р Т‘Р Р†Р С‘Р В¶Р ВµР Р…Р С‘РЎРЏ
    Action person = HUMAN; //Р Т‘Р В»РЎРЏ РЎвЂљР С‘Р С—Р В° Р СР С•Р Т‘Р ВµР В»РЎРЉР С”Р С‘
    Action moveOrc = BEGIN; //Р Т‘Р В»РЎРЏ Р Т‘Р Р†Р С‘Р В¶Р ВµР Р…Р С‘РЎРЏ Р Р†РЎР‚Р В°Р С–Р В°

    Stone stone; //Р С—Р С•Р СР С•Р С–Р В°Р ВµРЎвЂљ РЎРѓР С•Р В·Р Т‘Р В°Р Р†Р В°РЎвЂљРЎРЉ Р С”Р В»Р ВµРЎвЂљР С”Р С‘
    Person human, soldier; //Р С—Р ВµРЎР‚РЎРѓР С•Р Р…Р В°Р В¶Р С‘: РЎвЂЎР ВµР В»Р С•Р Р†Р ВµР С”, Р Р†Р С•Р С‘Р Р…,
    Person dwarf, dWarrior; //Р С–Р Р…Р С•Р С, Р С–Р Р…Р С•Р С-Р Р†Р С•Р С‘РЎвЂљР ВµР В»РЎРЉ;
    Person shield, orc; //РЎвЂ°Р С‘РЎвЂљ, Р С•РЎР‚Р С”

    //РЎРѓР С—Р С‘РЎРѓР С”Р С‘:

    QList<Stone> listRoom1; //Р Т‘Р В»РЎРЏ РЎвЂ¦РЎР‚Р В°Р Р…Р ВµР Р…Р С‘РЎРЏ Р С”Р В»Р ВµРЎвЂљР С•Р С” Р С”Р С•Р СР Р…Р В°РЎвЂљРЎвЂ№1
    QList<Stone> listRoom2; //Р Т‘Р В»РЎРЏ РЎвЂ¦РЎР‚Р В°Р Р…Р ВµР Р…Р С‘РЎРЏ Р С”Р В»Р ВµРЎвЂљР С•Р С” Р С”Р С•Р СР Р…Р В°РЎвЂљРЎвЂ№2
    QList<Stone> listBridge; //Р Т‘Р В»РЎРЏ РЎвЂ¦РЎР‚Р В°Р Р…Р ВµР Р…Р С‘РЎРЏ Р С”Р В»Р ВµРЎвЂљР С•Р С” Р СР С•РЎРѓРЎвЂљР В°
    QList<Stone> listFreeRoom1; //Р Т‘Р В»РЎРЏ РЎвЂ¦РЎР‚Р В°Р Р…Р ВµР Р…Р С‘РЎРЏ РЎРѓР Р†Р С•Р В±Р С•Р Т‘Р Р…РЎвЂ№РЎвЂ¦ Р С”Р В»Р ВµРЎвЂљР С•Р С” Р Р†Р Р…РЎС“РЎвЂљРЎР‚Р С‘ Р С”Р С•Р СР Р…Р В°РЎвЂљРЎвЂ№1
    QList<Stone> listFreeRoom2; //Р Т‘Р В»РЎРЏ РЎвЂ¦РЎР‚Р В°Р Р…Р ВµР Р…Р С‘РЎРЏ РЎРѓР Р†Р С•Р В±Р С•Р Т‘Р Р…РЎвЂ№РЎвЂ¦ Р С”Р В»Р ВµРЎвЂљР С•Р С” Р Р†Р Р…РЎС“РЎвЂљРЎР‚Р С‘ Р С”Р С•Р СР Р…Р В°РЎвЂљРЎвЂ№2
    QList<Stone> listFreeBridge; //Р Т‘Р В»РЎРЏ РЎвЂ¦РЎР‚Р В°Р Р…Р ВµР Р…Р С‘РЎРЏ РЎРѓР Р†Р С•Р В±Р С•Р Т‘Р Р…РЎвЂ№РЎвЂ¦ Р С”Р В»Р ВµРЎвЂљР С•Р С” Р Р†Р Р…РЎС“РЎвЂљРЎР‚Р С‘ Р СР С•РЎРѓРЎвЂљР В°

    //Р СР ВµРЎвЂљР С•Р Т‘РЎвЂ№:

    void createFirstRoom(); //РЎРѓР С•Р В·Р Т‘Р В°Р Р…Р С‘Р Вµ Р С—Р С•Р В·Р С‘РЎвЂ Р С‘Р в„– Р С—Р ВµРЎР‚Р Р†Р С•Р в„– Р С”Р С•Р СР Р…Р В°РЎвЂљРЎвЂ№
    void createBridge(); //РЎРѓР С•Р В·Р Т‘Р В°Р Р…Р С‘Р Вµ Р С—Р С•Р В·Р С‘РЎвЂ Р С‘Р в„– Р СР С•РЎРѓРЎвЂљР В° Р СР ВµР В¶Р Т‘РЎС“ Р С”Р С•Р СР Р…Р В°РЎвЂљР В°Р СР С‘
    void createSecondRoom(); //РЎРѓР С•Р В·Р Т‘Р В°Р Р…Р С‘Р Вµ Р С—Р С•Р В·Р С‘РЎвЂ Р С‘Р в„– Р Р†РЎвЂљР С•РЎР‚Р С•Р в„– Р С”Р С•Р СР Р…Р В°РЎвЂљРЎвЂ№
    void movePerson(Person &p); //Р С—Р ВµРЎР‚Р ВµР Т‘Р Р†Р С‘Р В¶Р ВµР Р…Р С‘Р Вµ Р С–Р ВµРЎР‚Р С•РЎРЏ
    void moveEnemy(); //Р С—Р ВµРЎР‚Р ВµР Т‘Р Р†Р С‘Р В¶Р ВµР Р…Р С‘Р Вµ Р Р†РЎР‚Р В°Р С–Р В°

    bool touchOrc(Person p); //Р С—РЎР‚Р С•Р Р†Р ВµРЎР‚Р С”Р В° Р С”Р В°РЎРѓР В°Р Р…Р С‘РЎРЏ Р С•РЎР‚Р С”Р В° Р С–Р ВµРЎР‚Р С•Р ВµР С
    bool touchShield(Person p); //Р С—РЎР‚Р С•Р Р†Р ВµРЎР‚Р С”Р В° Р С”Р В°РЎРѓР В°Р Р…Р С‘РЎРЏ РЎвЂ°Р С‘РЎвЂљР В° Р С–Р ВµРЎР‚Р С•Р ВµР С
    bool touchRoom(Person p); //Р С—РЎР‚Р С•Р Р†Р ВµРЎР‚Р С”Р В° Р С”Р В°РЎРѓР В°Р Р…Р С‘РЎРЏ Р С–РЎР‚Р В°Р Р…Р С‘РЎвЂ  Р С”Р С•Р СР Р…Р В°РЎвЂљ


    void fillInsideMap(QPainter* painter); //РЎР‚Р С‘РЎРѓР С•Р Р†Р В°Р Р…Р С‘Р Вµ Р С—Р С•Р В»Р В°
    void loadMap(QPainter* painter); //РЎР‚Р С‘РЎРѓР С•Р Р†Р В°Р Р…Р С‘Р Вµ Р С”Р В°РЎР‚РЎвЂљРЎвЂ№ (Р В·Р В°Р СР С”Р В°)
};
#endif // ANGBANDGAME_H
